wsdl/hello.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions
  xmlns:tns="http://example.com/hello"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  targetNamespace="http://example.com/hello"
  name="HelloService">

  <types>
    <xsd:schema targetNamespace="http://example.com/hello" elementFormDefault="qualified">
      <!-- sayHello -->
      <xsd:element name="sayHelloRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="name" type="xsd:string" minOccurs="0"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="sayHelloResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="greeting" type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- add -->
      <xsd:element name="addRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="a" type="xsd:double"/>
            <xsd:element name="b" type="xsd:double"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="addResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="result" type="xsd:double"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- subtract -->
      <xsd:element name="subtractRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="a" type="xsd:double"/>
            <xsd:element name="b" type="xsd:double"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="subtractResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="result" type="xsd:double"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

    </xsd:schema>
  </types>

  <message name="sayHelloInput">
    <part name="parameters" element="tns:sayHelloRequest"/>
  </message>
  <message name="sayHelloOutput">
    <part name="parameters" element="tns:sayHelloResponse"/>
  </message>

  <message name="addInput">
    <part name="parameters" element="tns:addRequest"/>
  </message>
  <message name="addOutput">
    <part name="parameters" element="tns:addResponse"/>
  </message>

  <message name="subtractInput">
    <part name="parameters" element="tns:subtractRequest"/>
  </message>
  <message name="subtractOutput">
    <part name="parameters" element="tns:subtractResponse"/>
  </message>

  <portType name="HelloServicePortType">
    <operation name="sayHello">
      <input message="tns:sayHelloInput"/>
      <output message="tns:sayHelloOutput"/>
    </operation>
    <operation name="add">
      <input message="tns:addInput"/>
      <output message="tns:addOutput"/>
    </operation>
    <operation name="subtract">
      <input message="tns:subtractInput"/>
      <output message="tns:subtractOutput"/>
    </operation>
  </portType>

  <binding name="HelloServiceSoapBinding" type="tns:HelloServicePortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="sayHello">
      <soap:operation soapAction="sayHello"/>
      <input><soap:body use="literal"/></input>
      <output><soap:body use="literal"/></output>
    </operation>
    <operation name="add">
      <soap:operation soapAction="add"/>
      <input><soap:body use="literal"/></input>
      <output><soap:body use="literal"/></output>
    </operation>
    <operation name="subtract">
      <soap:operation soapAction="subtract"/>
      <input><soap:body use="literal"/></input>
      <output><soap:body use="literal"/></output>
    </operation>
  </binding>

  <service name="HelloService">
    <documentation>Simple SOAP service with sayHello/add/subtract</documentation>
    <port name="HelloServiceSoapPort" binding="tns:HelloServiceSoapBinding">
      <soap:address location="http://localhost:3000/ws/hello"/>
    </port>
  </service>
</definitions>
